## 04. Pandas
- 파이썬 기반의 강력하고 사용하기 쉬운 데이터 분석 및 조작 라이브러리

In [173]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.3.3

### Pandas의 핵심 자료 구조
- Series
- DataFrame

### Series
- 인덱스(라벨)가 붙은 1차원 배열
- 인덱스 이름을 직접 지정할 수 있음

In [174]:
# 시리즈 생성
# 1. 리스트로 생성
data = [10, 20, 30, 40]
s = pd.Series(data)
print(s)

# 0    10
# 1    20
# 2    30
# 3    40
# dtype: int64

0    10
1    20
2    30
3    40
dtype: int64

In [175]:
# 2. 인덱스를 직접 지정
s = pd.Series(data, index=["a", "b", "c", "d"])
print(s)

# a    10
# b    20
# c    30
# d    40
# dtype: int64

a    10
b    20
c    30
d    40
dtype: int64

In [176]:
# 3. 딕셔너리로 생성 
data = {'서울' : 100, '부산' : 200, '대구' : 300, '제주' : 400}
s = pd.Series(data)
print(s)

# 서울    100
# 부산    200
# 대구    300
# 제주    400
# dtype: int64

서울    100
부산    200
대구    300
제주    400
dtype: int64

In [177]:
# 4. 하나의 값으로 시리즈를 생성
s = pd.Series(7, index=["가", "나", "다"])
print(s)

# 가    7
# 나    7
# 다    7
# dtype: int64

가    7
나    7
다    7
dtype: int64

In [178]:
# 시리즈의 주요 속성
data = [10, 20, 30, 40]
s = pd.Series(data, index=['a', 'b', 'c', 'd'], name='test data')
print("values", s.values) # 실제 데이터 배열    values [10 20 30 40]
print("index", s.index)   # 인덱스 객체         index Index(['a', 'b', 'c', 'd'], dtype='object')
print("dtype", s.dtype)   # 실제 데이터의 타입  dtype int64
print("size", s.size)     # 데이터의 개수       size 4
print("shape", s.shape)   # 배열의 형태         shape (4,)
print("name", s.name)     # 시리즈의 이름       name test data

values [10 20 30 40]
index Index(['a', 'b', 'c', 'd'], dtype='object')
dtype int64
size 4
shape (4,)
name test data

In [179]:
# 시리즈의 연산
s1 = pd.Series([10, 20, 30], index=["a", "b", "c"])
s2 = pd.Series([5, 6, 7], index=["c", "b", "d"])

result = s1 + s2
print(result)

# a     NaN
# b    26.0
# c    35.0
# d     NaN
# dtype: float64

a     NaN
b    26.0
c    35.0
d     NaN
dtype: float64

In [180]:
# 브로드 캐스팅
s = pd.Series([5, 10, 15], index=['x', 'y', 'z'])

print(s + 3)
# x     8
# y    13
# z    18
# dtype: int64
print(s * 2)
# x    10
# y    20
# z    30
# dtype: int64

x     8
y    13
z    18
dtype: int64
x    10
y    20
z    30
dtype: int64

In [181]:
# 불리언 연산 및 인덱싱
s = pd.Series([50, 60, 70, 80, 90, 100])

mask = s > 70
print(mask)
# 0    False
# 1    False
# 2    False
# 3     True
# 4     True
# 5     True
# dtype: bool
print(s[mask])
# 3     80
# 4     90
# 5    100
# dtype: int64

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool
3     80
4     90
5    100
dtype: int64

In [182]:
# 실습1. Series 연습(1)
# 1. 파이썬 리스트 [5, 10, 15, 20]을 이용해 Series를 생성하세요.
data = pd.Series([5, 10, 15, 20])
print("문제 1. \n", data)

# 2. 값 [90, 80, 85, 70]에 대해 인덱스를 각각 '국어', '영어', '수학', '과학'으로 지정한 Series를 만드세요.
subjects = pd.Series([90, 80, 85, 70], index=["국어", "영어", "수학", "과학"])
print("\n문제 2. \n", subjects)

# 3. {'서울': 950 , '부산': 340 , '인천': 520} 딕셔너리를 이용해 Series를 만들고, 인천의 값을 출력하세요.
city_dict = {'서울': 950 , '부산': 340 , '인천': 520}
city = pd.Series(city_dict)
print("\n문제 3. \n", city)

문제 1.
 0     5
1    10
2    15
3    20
dtype: int64

문제 2.
 국어    90
영어    80
수학    85
과학    70
dtype: int64

문제 3.
 서울    950
부산    340
인천    520
dtype: int64

In [183]:
# 실습1. Series 연습(2)
# 4. Series [1, 2, 3, 4]를 만들고, 데이터 타입(dtype)을 출력하세요.
data = pd.Series([1, 2, 3, 4])
print("문제 4. 데이터 타입 : ", data.dtype)

# 5. 아래 두 Series의 합을 구하세요.
s1 = pd.Series([3, 5, 7], index=['a', 'b', 'c'])
s2 = pd.Series([10, 20, 30], index=['b', 'c', 'd'])

print("\n문제 5. \n", s1 + s2)

# # 6. Series [1, 2, 3, 4, 5]의 각 값에 10을 더한 Series를 만드세요.
broad_c = pd.Series([1, 2, 3, 4, 5])

print("\n문제 6.\n", broad_c + 10)

문제 4. 데이터 타입 :  int64

문제 5.
 a     NaN
b    15.0
c    27.0
d     NaN
dtype: float64

문제 6.
 0    11
1    12
2    13
3    14
4    15
dtype: int64

### DataFrame
- 2차원 라벨 데이터 구조
- Series를 모아놓은 것
- 행과 열이 있고, 행과 열에 대해 라벨을 부여할 수 있다.

In [184]:
# DataFrame 생성

# 1. 딕셔너리로 생성
data = {
    "이름" : ['kim', 'lee', 'sin'],
    "나이" : [15, 25, 33],
    "도시" : ['서울', '부산', '대구']
}

df = pd.DataFrame(data)
df


#   이름	나이	 도시
# 0	kim	    15	    서울
# 1	lee	    25	    부산
# 2	sin	    33	    대구

    이름  나이  도시
0  kim  15  서울
1  lee  25  부산
2  sin  33  대구

In [185]:
# 2. 리스트의 리스트(2차원 리스트)로 생성
data = [[1, "a"], [2, "b"], [3, "c"]]
df = pd.DataFrame(data, columns=["번호", "코드"])
df

#      번호    코드
#   0	1	    a
#   1	2	    b
#   2	3	    c

   번호 코드
0   1  a
1   2  b
2   3  c

In [186]:
# 3. 딕셔너리 리스트로 생성
data = [
    {'이름' : 'Kim', '나이' : 28, '도시' : '제주'},
    {'이름' : 'Choi', '나이' : 27, '도시' : '울산'}
]
df = pd.DataFrame(data, index=["bf", "gf"])
df


#       이름	나이	도시
# bf	Kim	    28  	제주
# gf	Choi	27	    울산

      이름  나이  도시
bf   Kim  28  제주
gf  Choi  27  울산

In [187]:
# 4. Series의 딕셔너리로 생성
s1 = pd.Series(["국어", "수학", "영어"], index=["a", "b", "c"])
s2 = pd.Series([100, 90, 85], index=["a", "b", "c"])

df = pd.DataFrame({"과목" : s1, "점수" : s2})
df


#       과목	점수
#   a	국어	100
#   b	수학	90
#   c	영어	85

   과목   점수
a  국어  100
b  수학   90
c  영어   85

In [188]:
# DataFrame 기본 속성
data = [
    {'이름' : 'Kim', '나이' : 28, '도시' : '제주'},
    {'이름' : 'Choi', '나이' : 27, '도시' : '울산'}
]

df = pd.DataFrame(data)

print("shape : ", df.shape)
print("columns : ", df.columns)
print("index : ", df.index)
print("dtype : ", df.dtypes)
print("values : ", df.values)
print("info : ", df.info())


# DataFrame 기본 속성
data = [
    {'이름' : 'Kim', '나이' : 28, '도시' : '제주'},
    {'이름' : 'Choi', '나이' : 27, '도시' : '울산'}
]

df = pd.DataFrame(data)

print("shape : ", df.shape)
print("columns : ", df.columns)
print("index : ", df.index)
print("dtype : ", df.dtypes)
print("values : ", df.values)
print("info : ", df.info())


# shape :  (2, 3)
# columns :  Index(['이름', '나이', '도시'], dtype='object')
# index :  RangeIndex(start=0, stop=2, step=1)
# dtype :  이름    object
# 나이     int64
# 도시    object
# dtype: object
# values :  [['Kim' 28 '제주']
#  ['Choi' 27 '울산']]
# <class 'pandas.core.frame.DataFrame'>
# RangeIndex: 2 entries, 0 to 1
# Data columns (total 3 columns):
#  #   Column  Non-Null Count  Dtype 
# ---  ------  --------------  ----- 
#  0   이름      2 non-null      object
#  1   나이      2 non-null      int64 
#  2   도시      2 non-null      object
# dtypes: int64(1), object(2)
# memory usage: 180.0+ bytes
# info :  None

shape :  (2, 3)
columns :  Index(['이름', '나이', '도시'], dtype='object')
index :  RangeIndex(start=0, stop=2, step=1)
dtype :  이름    object
나이     int64
도시    object
dtype: object
values :  [['Kim' 28 '제주']
 ['Choi' 27 '울산']]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      2 non-null      object
 1   나이      2 non-null      int64
 2   도시      2 non-null      object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes
info :  None
shape :  (2, 3)
columns :  Index(['이름', '나이', '도시'], dtype='object')
index :  RangeIndex(start=0, stop=2, step=1)
dtype :  이름    object
나이     int64
도시    object
dtype: object
values :  [['Kim' 28 '제주']
 ['Choi' 27 '울산']]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      2 non-null      object
 1   나이      2 non-null      int64
 2   도시      2 non-null      object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes
info :  None

In [189]:
# 실습2. DataFrame 연습(1)
# 1. 다음 데이터로 DataFrame을 생성하고, 컬럼명을'이름', '나이', '도시'로 지정하세요.
data = [['홍길동',28, '서울'],
        ['김철수',33, '부산'],
        ['이영희',25, '대구']]
df = pd.DataFrame(data, columns=["이름", "나이", "도시"])
print("문제 1. \n", df)

# 2. 아래와 같은 딕셔너리로 DataFrame을 생성하세요.
data =  {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print("\n문제 2. \n", df)

# 3. 아래 데이터를 사용해 DataFrame을 만드세요.
data = [{'과목': '수학', '점수': 90}, {'과목': '영어', '점수': 85}, {'과목': '과학', '점수': 95}]
df = pd.DataFrame(data)
print("\n문제 3. \n", df)

# 4. 아래 데이터를 사용해 DataFrame을 생성하되, 인덱스를['학생1', '학생2', '학생3']으로 ..지정하세요.
data = {'이름': ['민수', '영희', '철수'], '점수': [80, 92, 77]}
df = pd.DataFrame(data, index=["학생1", "학생2", "학생3"])
print("\n문제 4.\n", df)

문제 1.
     이름  나이  도시
0  홍길동  28  서울
1  김철수  33  부산
2  이영희  25  대구

문제 2.
    A  B
0  1  4
1  2  5
2  3  6

문제 3.
    과목  점수
0  수학  90
1  영어  85
2  과학  95

문제 4.
      이름  점수
학생1  민수  80
학생2  영희  92
학생3  철수  77

In [190]:
# 실습2. DataFrame 연습(2)
# 5. 아래  Series 객체 2개를 이용해 DataFrame을 만드세요.
kor = pd.Series([90, 85, 80], index=['a', 'b', 'c'])
eng = pd.Series([95, 88, 82], index=['a', 'b', 'c'])
df = pd.DataFrame({"kor" : kor, "eng" : eng})
print("문제 5. \n", df)

# 6. 아래 딕셔너리로 DataFrame을 만들고, 컬럼순서를['B', 'A']로 지정해 출력하세요.
data = {'A': [1, 2], 'B': [3, 4]}
df = pd.DataFrame(data, columns=["B", "A"])
print("\n문제 6.\n", df)

# 7. 데이터를 DataFrame으로 만들고, 컬럼명을 ['product', 'price', 'stock']으로 변경하세요.
prd = [['펜', 1000, 50], ['노트', 2000, 30]]
df_prd = pd.DataFrame(prd, columns=['product', 'price', 'stock'])
print("\n문제 7.\n", df_prd)

# 8. 아래 DataFrame을 생성한뒤, '국가' 컬럼만 추출하세요.
coun = {'국가': ['한국', '일본', '미국'], '수도': ['서울', '도쿄', '워싱턴']}
df_coun = pd.DataFrame(coun)
print("\n문제 8.\n", df_coun['국가'])

문제 5.
    kor  eng
a   90   95
b   85   88
c   80   82

문제 6.
    B  A
0  3  1
1  4  2

문제 7.
   product  price  stock
0       펜   1000     50
1      노트   2000     30

문제 8.
 0    한국
1    일본
2    미국
Name: 국가, dtype: object

In [191]:
# 데이터 탐색과 요약
data = {
    "이름": ["홍길동", "이순신", "김유신", "강감찬", "장보고", "이방원"],
    "나이": [23, 35, 31, 40, 28, 34],
    "직업": ["학생", "군인", "장군", "장군", "상인", "왕자"]
}
df = pd.DataFrame(data)
df


#   이름	    나이	직업
# 0	홍길동	    23	    학생
# 1	이순신	    35	    군인
# 2	김유신	    31	    장군
# 3	강감찬	    40	    장군
# 4	장보고	    28	    상인
# 5	이방원	    34	    왕자

    이름  나이  직업
0  홍길동  23  학생
1  이순신  35  군인
2  김유신  31  장군
3  강감찬  40  장군
4  장보고  28  상인
5  이방원  34  왕자

In [192]:
# 데이터 앞부분 미리 보기 : head(n)
# 기본값 n = 5
df.head()
# 	이름	나이	직업
# 0	홍길동	23	    학생
# 1	이순신	35	    군인
# 2	김유신	31	    장군
# 3	강감찬	40	    장군
# 4	장보고	28	    상인

df.head(3)
#     이름	나이	직업
# 0	홍길동	23	    학생
# 1	이순신	35	    군인
# 2	김유신	31	    장군

    이름  나이  직업
0  홍길동  23  학생
1  이순신  35  군인
2  김유신  31  장군

In [193]:
# 데이터 뒷부분 미리보기 : tail(n)
df.tail()
# 	이름	나이	직업
# 1	이순신	35	    군인
# 2	김유신	31	    장군
# 3	강감찬	40	    장군
# 4	장보고	28	    상인
# 5	이방원	34	    왕자
df.tail(3)
# 	이름	나이	직업
# 3	강감찬	40	    장군
# 4	장보고	28	    상인
# 5	이방원	34	    왕자

    이름  나이  직업
3  강감찬  40  장군
4  장보고  28  상인
5  이방원  34  왕자

In [194]:
# 데이터 요약 정보 : info()
df.info()

# <class 'pandas.core.frame.DataFrame'>
# RangeIndex: 6 entries, 0 to 5
# Data columns (total 3 columns):
#  #   Column  Non-Null Count  Dtype 
# ---  ------  --------------  ----- 
#  0   이름      6 non-null      object
#  1   나이      6 non-null      int64 
#  2   직업      6 non-null      object
# dtypes: int64(1), object(2)
# memory usage: 276.0+ bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   직업      6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [195]:
# describe() 함수
df.describe() # 기본적으로 수치형 컬럼만 요약
df.describe(include="object")
# 	    이름	직업
# count	  6	    6
# unique  6 	5
# top	홍길동	장군
# freq	  1	    2

df.describe(include="all")
# 	    이름	나이	직업
# count	  6	  6.000000	6
# unique  6	    NaN	    5
# top	홍길동	NaN	    장군
# freq	  1	    NaN	    2
# mean	NaN	31.833333	NaN
# std	NaN	5.913262	NaN
# min	NaN	23.000000	NaN
# 25%	NaN	28.750000	NaN
# 50%	NaN	32.500000	NaN
# 75%	NaN	34.750000	NaN
# max	NaN	40.000000	NaN

         이름         나이   직업
count     6   6.000000    6
unique    6        NaN    5
top     홍길동        NaN   장군
freq      1        NaN    2
mean    NaN  31.833333  NaN
std     NaN   5.913262  NaN
min     NaN  23.000000  NaN
25%     NaN  28.750000  NaN
50%     NaN  32.500000  NaN
75%     NaN  34.750000  NaN
max     NaN  40.000000  NaN

### 인덱싱과 슬라이싱

In [196]:
# 인덱싱 : 컬럼에 대해 인덱싱을 적용
# 특정 컬럼(Series) 선택
df["이름"]

# 0    홍길동
# 1    이순신
# 2    김유신
# 3    강감찬
# 4    장보고
# 5    이방원
# Name: 이름, dtype: object


# 여러 컬럼을 리스트로 선택
df[["이름", "나이"]]
# 	이름	나이
# 0	홍길동	23
# 1	이순신	35
# 2	김유신	31
# 3	강감찬	40
# 4	장보고	28
# 5	이방원	34

# . 으로도 조회가 가능함
df.나이
# 0    23
# 1    35
# 2    31
# 3    40
# 4    28
# 5    34
# Name: 나이, dtype: int64

0    23
1    35
2    31
3    40
4    28
5    34
Name: 나이, dtype: int64

In [197]:
# 슬라이싱
df[1:4]

#   이름	나이	직업
# 1	이순신	35	    군인
# 2	김유신	31	    장군
# 3	강감찬	40	    장군

df[-3:]

# 	이름	나이	직업
# 3	강감찬	40	    장군
# 4	장보고	28	    상인
# 5	이방원	34	    왕자

# 슬라이싱은 행 기준으로 작동, 열 기준은 별도의 방법을 사용해야함

# df[:, 0:2]              # KeyError 발생

    이름  나이  직업
3  강감찬  40  장군
4  장보고  28  상인
5  이방원  34  왕자

### iloc / loc

In [198]:
# iloc
# integer location
# 정수 위치 기반의 인덱싱, 슬라이싱
# NumPy의 슬라이싱과 유사하게 동작함

# 단일 행 / 열 선택
df.iloc[0] # 첫 번째 행
df.iloc[:, 0:2]
# 이름    홍길동
# 나이     23
# 직업     학생
# Name: 0, dtype: object

df.iloc[:, 0:2] # 두 번째 열
#   이름	나이
# 0	홍길동	23
# 1	이순신	35
# 2	김유신	31
# 3	강감찬	40
# 4	장보고	28
# 5	이방원	34

    이름  나이
0  홍길동  23
1  이순신  35
2  김유신  31
3  강감찬  40
4  장보고  28
5  이방원  34

In [199]:
# 여러 행 / 열 동시 선택
df.iloc[1:4]
#   이름	나이	직업
# 1	이순신	35	    군인
# 2	김유신	31	    장군
# 3	강감찬	40	    장군

df.iloc[:, 0:2]
# 	이름	나이
# 0	홍길동	23
# 1	이순신	35
# 2	김유신	31
# 3	강감찬	40
# 4	장보고	28
# 5	이방원	34

df.iloc[1:4, 0:2]
# 	이름	나이
# 1	이순신	35
# 2	김유신	31
# 3	강감찬	40

    이름  나이
1  이순신  35
2  김유신  31
3  강감찬  40

In [200]:
# Fancy Indexing

df.iloc[[0, 2, 4]]
# 	이름	나이	직업
# 0	홍길동	23	    학생
# 2	김유신	31	    장군
# 4	장보고	28	    상인

df.iloc[:, [1, 2]]

#      나이	        직업
# 0	    23	        학생
# 1	    35	        군인
# 2	    31	        장군
# 3	    40	        장군
# 4	    28	        상인
# 5	    34	        왕자

df.iloc[[0, 2, 4], [1, 2]]
# 	나이	직업
# 0	23	    학생
# 2	31	    장군
# 4	28	    상인

   나이  직업
0  23  학생
2  31  장군
4  28  상인

In [201]:
# 음수 인덱스 슬라이싱
df.iloc[-1]
# 이름    이방원
# 나이     34
# 직업     왕자
# Name: 5, dtype: object

df.iloc[:, -2:]
# 	나이	직업
# 0	23	    학생
# 1	35	    군인
# 2	31	    장군
# 3	40	    장군
# 4	28	    상인
# 5	34	    왕자

   나이  직업
0  23  학생
1  35  군인
2  31  장군
3  40  장군
4  28  상인
5  34  왕자

In [202]:
# loc
# location
# 라벨의 이름 기준으로 인덱싱 / 슬라이싱
# 단일 행 / 열 선택
# 시작과 끝을 모두 포함
# 음수 인덱스는 사용 x

df.loc[0]
# 이름    홍길동
# 나이     23
# 직업     학생
# Name: 0, dtype: object

df.loc[:, "이름"]
# 0    홍길동
# 1    이순신
# 2    김유신
# 3    강감찬
# 4    장보고
# 5    이방원
# Name: 이름, dtype: object

# 여러 행 / 열 선택

df.loc[2:4, ["이름", "직업"]]
#     이름	직업
# 2	김유신	장군
# 3	강감찬	장군
# 4	장보고	상인

df.loc[2:4, "이름":"직업"]

#   이름	    나이	    직업
# 2	김유신	    31	        장군
# 3	강감찬	    40	        장군
# 4	장보고	    28	        상인

    이름  나이  직업
2  김유신  31  장군
3  강감찬  40  장군
4  장보고  28  상인

In [203]:
# 조건식
mask = df["나이"] >= 30
df.loc[mask, ["이름", "나이"]]

#     이름	나이
# 1	이순신	35
# 2	김유신	31
# 3	강감찬	40
# 5	이방원	34

    이름  나이
1  이순신  35
2  김유신  31
3  강감찬  40
5  이방원  34

In [204]:
# 컬럼을 인덱스로 지정
df2 = df.set_index("이름")
df2

#           나이	 직업
# 이름		
# 홍길동	 23	    학생
# 이순신	 35	    군인
# 김유신     31     장군
# 강감찬	 40	    장군
# 장보고	 28	    상인
# 이방원	 34	    왕자

     나이  직업
이름
홍길동  23  학생
이순신  35  군인
김유신  31  장군
강감찬  40  장군
장보고  28  상인
이방원  34  왕자

In [205]:
# 실습3. iloc , loc연습(1)
data = {
"이름": ["홍길동", "이순신", "김유신", "강감찬", "장보고", "이방원", "최무선", "정도전"],
"나이": [23, 35, 31, 40 , 28, 34 , 42, 29],
"직업": ["학생", "군인", "장군", "장군", "상인", "왕자", "과학자", "정치가"],
"점수": [85, 90, 75, 88, 92, 95, 87, 83]
}
df = pd.DataFrame(data)
print(df)

    이름  나이   직업  점수
0  홍길동  23   학생  85
1  이순신  35   군인  90
2  김유신  31   장군  75
3  강감찬  40   장군  88
4  장보고  28   상인  92
5  이방원  34   왕자  95
6  최무선  42  과학자  87
7  정도전  29  정치가  83

In [206]:
# 1. iloc을 사용해 인덱스 2~5(포함 안함) 행, 1~3(포함 안함) 열만 선택해 출력하세요.
print("문제 1. \n", df.iloc[2:5, 1:3])

# 2. loc을 사용해 인덱스 3~6(포함!) 행, '이름'과 '점수' 컬럼만 출력하세요.
print("\n문제 2. \n", df.loc[3:6, ["이름", "점수"]])

# 3. iloc을 사용해, 마지막 3개 행의'직업'과 '점수' 컬럼만 선택해 출력하세요.
print("\n문제 3. \n", df.iloc[-3:, [2, 3]])

문제 1.
    나이  직업
2  31  장군
3  40  장군
4  28  상인

문제 2.
     이름  점수
3  강감찬  88
4  장보고  92
5  이방원  95
6  최무선  87

문제 3.
     직업  점수
5   왕자  95
6  과학자  87
7  정치가  83

In [207]:
# 4. iloc을 사용해, 홀수 번째 (1, 3, 5, 7번 인덱스) 행, 모든 열을 선택하세요.
print("\n문제 4. \n", df.iloc[[1, 3, 5, 7], :])

# 5. loc을 사용해, 인덱스 4~7번 행, '나이', '점수' 컬럼만 출력하세요.
print("\n문제 5. \n", df.loc[4:, ["나이", "점수"]])

# 6. iloc을 사용해, 짝수 번째 (0,2,4,6) 행과 짝수 번째(0,2) 열만 선택하세요.
print("\n문제 6. \n", df.iloc[[0, 2, 4, 6], [0, 2]])

문제 4.
     이름  나이   직업  점수
1  이순신  35   군인  90
3  강감찬  40   장군  88
5  이방원  34   왕자  95
7  정도전  29  정치가  83

문제 5.
    나이  점수
4  28  92
5  34  95
6  42  87
7  29  83

문제 6.
     이름   직업
0  홍길동   학생
2  김유신   장군
4  장보고   상인
6  최무선  과학자

### 통계 함수

In [ ]:
data = {
    "상품명": ["무선 이어폰", "스마트 워치", "텀블러", "노트북", "블루투스 스피커", "무드등"],
    "가격": [129000, 250000, 15000, 1200000, 85000, 22000],
    "재고": [23, 12, 54, 5, 17, 31]
}
df = pd.DataFrame(data)

# 	    상품명	    가격	    재고
# 0	무선 이어폰	    129000	    23
# 1	스마트 워치	    250000	    12
# 2	텀블러	        15000	    54
# 3	노트북	        1200000 	5
# 4	블루투스 스피커	 85000	    17
# 5	무드등	        22000	    31

        상품명       가격  재고
0    무선 이어폰   129000  23
1    스마트 워치   250000  12
2       텀블러    15000  54
3       노트북  1200000   5
4  블루투스 스피커    85000  17
5       무드등    22000  31

In [209]:
df.describe(include="all")

           상품명            가격         재고
count        6  6.000000e+00   6.000000
unique       6           NaN        NaN
top     무선 이어폰           NaN        NaN
freq         1           NaN        NaN
mean       NaN  2.835000e+05  23.666667
std        NaN  4.571305e+05  17.339742
min        NaN  1.500000e+04   5.000000
25%        NaN  3.775000e+04  13.250000
50%        NaN  1.070000e+05  20.000000
75%        NaN  2.197500e+05  29.000000
max        NaN  1.200000e+06  54.000000

In [210]:
# 평균
df["가격"].mean()   # np.float64(283500.0)

# 중앙값
df["재고"].median() # np.float64(20.0)

# 표준 편차
df["가격"].std()    # np.float64(457130.5065295905)
df["재고"].std()    # np.float64(17.339742404853272)

# 분산
df["재고"].var()    # np.float64(300.6666666666667)

# 값의 개수
df["상품명"].count()# np.int64(6)

# 최댓값 / 최솟값
df["가격"].max()    # np.int64(1200000)
df["재고"].min()    # np.int64(5)

# 합계
df["가격"].sum()    # np.int64(1701000)

np.int64(1701000)

In [211]:
# 최대값의 위치와 최소값의 위치
df.idxmax()
# 상품명    2
# 가격     3
# 재고     2
# dtype: int64

df.idxmin()
# 상품명    3
# 가격     2
# 재고     3
# dtype: int64

df["가격"].idxmin()     # 2

2

#### 결측값 처리
- 결측값(Missing Value, NA, Null) :데이터에 값이 기록되지 않은 상태
> Pandas에서는 보통 NaN(Not a Numver, float), None(object), Na 등으로 처리

In [ ]:
data = {
    "이름": ["서준", "하은", "민준", "서연", "이안", "지민"],
    "나이": [22, 28, np.nan, 31, 27, 24],
    "점수": [89, np.nan, 83, 90, 88, 93]
}
df = pd.DataFrame(data)


# 	이름	나이	점수
# 0	서준	22.0	89.0
# 1	하은	28.0	NaN
# 2	민준	NaN	    83.0
# 3	서연	31.0	90.0
# 4	이안	27.0	88.0
# 5	지민	24.0	93.0

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0   NaN
2  민준   NaN  83.0
3  서연  31.0  90.0
4  이안  27.0  88.0
5  지민  24.0  93.0

In [ ]:
# 결측값 탐지
# isnull : 결측값이 맞으면 True 아니면 False
df.isnull()
# 	이름	나이	점수
# 0	False	False	False
# 1	False	False	True
# 2	False	True	False
# 3	False	False	False
# 4	False	False	False
# 5	False	False	False

# 각 컬럼의 결측값의 수 계산
df.isnull().sum()
# 이름    0
# 나이    1
# 점수    1
# dtype: int64

# 데이터의 전체 결측값 수 계산
df.isnull().sum().sum()     # np.int64(2)

      이름     나이     점수
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4  False  False  False
5  False  False  False

In [ ]:
# notnull() : 결측값이 아니면 True 맞으면 False
df.notnull()
    # 이름	나이	점수
# 0	True	True	True
# 1	True	True	False
# 2	True	False	True
# 3	True	True	True
# 4	True	True	True
# 5	True	True	True

     이름     나이     점수
0  True   True   True
1  True   True  False
2  True  False   True
3  True   True   True
4  True   True   True
5  True   True   True

In [223]:
# 결측값 제거 : dropna()
# 결측값이 있는 행을 삭제
df2 = df.dropna()
df2

#   이름	나이	점수
# 0	서준	22.0	89.0
# 3	서연	31.0	90.0
# 4	이안	27.0	88.0
# 5	지민	24.0	93.0

   이름    나이    점수
0  서준  22.0  89.0
3  서연  31.0  90.0
4  이안  27.0  88.0
5  지민  24.0  93.0

In [222]:
# 결측값이 있는 열을 삭제
df3 = df.dropna(axis=1)
df3

#   이름
# 0	서준
# 1	하은
# 2	민준
# 3	서연
# 4	이안
# 5	지민

   이름
0  서준
1  하은
2  민준
3  서연
4  이안
5  지민

In [ ]:
# 결측값 대체(채우기) : fillna()
# 결측값을 특정 값으로 대체
df4 = df.fillna(0)
df4

# 	이름	나이	점수
# 0	서준	22.0	89.0
# 1	하은	28.0	0.0
# 2	민준	0.0	    83.0
# 3	서연	31.0	90.0
# 4	이안	27.0	88.0
# 5	지민	24.0	93.0

avg_age = df["나이"].mean()
avg_age     # np.float64(26.4)

df["나이"] = df["나이"].fillna(avg_age)
df

# 	이름	나이	점수
# 0	서준	22.0	89.0
# 1	하은	28.0	NaN
# 2	민준	26.4	83.0    # 평균값 추가!
# 3	서연	31.0	90.0
# 4	이안	27.0	88.0
# 5	지민	24.0	93.0

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0   NaN
2  민준  26.4  83.0
3  서연  31.0  90.0
4  이안  27.0  88.0
5  지민  24.0  93.0

In [ ]:
# 이전 값으로 결측값 채우기 (foward fill)
df5 = df.ffill()
df5

# 	이름	나이	점수
# 0	서준	22.0	89.0
# 1	하은	28.0	89.0  0번 인덱스 값으로 채움(이전 값)
# 2	민준	26.4	83.0
# 3	서연	31.0	90.0
# 4	이안	27.0	88.0
# 5	지민	24.0	93.0

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0  89.0
2  민준  26.4  83.0
3  서연  31.0  90.0
4  이안  27.0  88.0
5  지민  24.0  93.0

In [ ]:
# 다음 값으로 결측값 채우기 (backward fill)
df6 = df.bfill()
df6


#     이름	나이	점수
# 0	서준	22.0	89.0
# 1	하은	28.0	83.0    2번 인덱스 값으로 변경 (다음 값)
# 2	민준	26.4	83.0 
# 3	서연	31.0	90.0
# 4	이안	27.0	88.0
# 5	지민	24.0	93.0

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0  83.0
2  민준  26.4  83.0
3  서연  31.0  90.0
4  이안  27.0  88.0
5  지민  24.0  93.0

In [ ]:
# 실습4. 통계 함수 · 결측값 처리 연습(1)
data = {
"도시": ["서울", "부산", "광주", "대구", np.nan, "춘천"],
"미세먼지": [45, 51, np.nan, 38, 49 , np.nan],
"초미세먼지": [20, np.nan, 17, 18, 22, 19],
"강수량": [0.0, 2.5, 1.0, np.nan, 3.1, 0.0]
}
df = pd.DataFrame(data)
#     도시	미세먼지	초미세먼지	강수량
# 0	서울	45.0	    20.0	    0.0
# 1	부산	51.0	    NaN	        2.5
# 2	광주	NaN	        17.0	    1.0
# 3	대구	38.0	    18.0	    NaN
# 4	NaN	    49.0	    22.0	    3.1
# 5	춘천	NaN	        19.0	    0.0

    도시  미세먼지  초미세먼지  강수량
0   서울  45.0   20.0  0.0
1   부산  51.0    NaN  2.5
2   광주   NaN   17.0  1.0
3   대구  38.0   18.0  NaN
4  NaN  49.0   22.0  3.1
5   춘천   NaN   19.0  0.0

In [ ]:
# 실습4 . 통계 함수 · 결측값 처리 연습(2)
# 1. ‘미세먼지’ 컬럼의 평균과 중앙값을 구하세요.
print(f"문제 1 . \n 평균 : {df["미세먼지"].mean()} \n 중앙값 : {df["미세먼지"].median()}")

# 2. ‘초미세먼지’ 컬럼의 최댓값과 최솟값을 구하세요.
print(f"\n문제 2 . \n최댓값 : {df["초미세먼지"].max()} \n최솟값 : {df["초미세먼지"].min()}")

# 3. 각 컬럼별 결측값 개수를 구하세요.
print("\n문제 3 . \n", df.isnull().sum())

문제 1 .
 평균 : 45.75
 중앙값 : 47.0

문제 1 .
최댓값 : 22.0
최솟값 : 17.0

문제 1 .
 도시       1
미세먼지     2
초미세먼지    1
강수량      1
dtype: int64

In [256]:
# 4. 결측값이 하나라도 있는 행을 모두 삭제한 뒤, 남은 데이터의 ‘초미세먼지’ 평균을 구하세요.
df1 = df.dropna(axis=0, how="any")
print("문제 4 . \n","초미세먼지 평균 : ", df1["초미세먼지"].mean())

# 5. 결측값을 모두 0으로 채운 뒤, ‘미세먼지’와 ‘초미세먼지’의 합계를 각각 구하세요.
df2 = df.fillna(0)
print(f"\n문제 5 . \n미세먼지 합 :{df2["미세먼지"].sum()} \n초미세먼지 합 : {df["초미세먼지"].sum()}")

# 6. ‘미세먼지’ 컬럼의 결측값을 평균값으로 채운 뒤, 그 표준편차를 구하세요
df3 = df.fillna(df["미세먼지"].mean())
df3
print("\n문제 6 . \n", df3)
print("표준편차 : ", df3["미세먼지"].std())

문제 4 .
 초미세먼지 평균 :  20.0

문제 5 .
미세먼지 합 :183.0
초미세먼지 합 : 96.0

문제 6 .
       도시   미세먼지  초미세먼지    강수량
0     서울  45.00  20.00   0.00
1     부산  51.00  45.75   2.50
2     광주  45.75  17.00   1.00
3     대구  38.00  18.00  45.75
4  45.75  49.00  22.00   3.10
5     춘천  45.75  19.00   0.00
표준편차 :  4.444097208657794